SaitovSP/src/Documents/Инкасация/Инкасация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инкасация</name>
  <registerRecords>AccumulationRegister.ДенежныеСредстваСети</registerRecords>
  <attributes>
    <name>РесторанИнкасации</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыручкаРесторана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

SaitovSP/src/AccumulationRegisters/ДенежныеСредстваСети/ДенежныеСредстваСети.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваСети</name>
  <resources>
    <name>Выручка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SaitovSP/src/Documents/Инкасация/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДенежныеСредстваСети Расход
	Движения.ДенежныеСредстваСети.Записывать = Истина;
	Движение = Движения.ДенежныеСредстваСети.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Ресторан = РесторанИнкасации;
	Движение.Выручка = Сумма;

	// регистр ДенежныеСредстваСети Приход
	Движения.ДенежныеСредстваСети.Записывать = Истина;
	Движение = Движения.ДенежныеСредстваСети.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Ресторан = Офис;
	Движение.Выручка = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
